app/views/collections/_collection.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."collection_id" = $1  [["collection_id", 9]]
---
      <ul class="list-group list-group-flush">
        <% collection.articles.each do |article| %>