app/views/collections/show.html.erb

      <ul class="list-group list-group-flush">
        <% @collection.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."collection_id" = $1  [["collection_id", 9]]