app/views/articles/_article.html.erb

SELECT "materials".* FROM "materials" INNER JOIN "article_materials" ON "materials"."id" = "article_materials"."material_id" WHERE "article_materials"."article_id" = $1  [["article_id", 8]]
---
      <tbody>
        <% article.materials.each do |material| %>