app/views/articles/_form.html.erb

    <%= form.label :category_id, "Categoria", style: "display: block" %>
    <%= form.select :category_id, Category.all.pluck(:name, :id), {} %>
---
SELECT "categories"."name", "categories"."id" FROM "categories"

    <%= form.label :material_ids, "Materiales", style: "display: block" %>
    <%= form.select :material_ids, Material.all.pluck(:name, :id), {}, {multiple: true, size: 5} %>
---
SELECT "materials"."name", "materials"."id" FROM "materials"