app/controllers/articles_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @collection = Collection.find(params[:collection_id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def new
    @collection = Collection.find(params[:collection_id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."collection_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["collection_id", 9], ["id", 15], ["LIMIT", 1]]
---
  def edit
    @collection = Collection.find(params[:collection_id])
    @article = @collection.articles.find(params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "articles" ("model", "category_id", "description", "created_at", "updated_at", "collection_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["model", "Mesa"], ["category_id", 1], ["description", "kk"], ["created_at", "2023-09-28 01:19:23.754958"], ["updated_at", "2023-09-28 01:19:23.754958"], ["collection_id", 9]]
---
  def create
    @collection = Collection.find(params[:collection_id])
    @article = @collection.articles.build(article_params)

    respond_to do |format|
      if @article.save

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 14]]
SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def destroy
    @article.destroy
    @collection = Collection.find(params[:collection_id])