app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."owner_id" = $1  [["owner_id", 1]]
---
  def index
    @collections = Collection.where(owner_id: current_user.id)

INSERT INTO "collections" ("name", "owner_id", "manufacturing_lead_time", "estimated_release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @collection = Collection.new(collection_params)
    respond_to do |format|

      if @collection.save

DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 1]]
---
  def destroy
    @collection.destroy

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_collection
      @collection = Collection.find(params[:id])