app/controllers/collections_controller.rb

  def index
    # if Current.user.engineer? || Current.user.designer?
    #   @collections = Collection.all
    # #   @collections = Collection.where(aasm_state: ["in_review", "approved", "waiting_to_materials", "waiting_to_makers", "waiting_to_be_completed"])
    # # elsif Current.user.designer?

    # #   @collections = Collection.where(owner_id: current_user.id, aasm_state: ["started", "redefine"])
    # else
    #   redirect_to orders_path
    # end
    @collections = Collection.all
---
SELECT "collections".* FROM "collections"