app/controllers/products_controller.rb

    def create
      @product = Product.new(product_params)

      respond_to do |format|
        if @product.save
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?)  [["name", "Producto4"], ["description", " descripcion p4"], ["created_at", "2023-06-08 18:48:08.179642"], ["updated_at", "2023-06-08 18:48:08.179642"], ["price", nil]]